# SparkSQL R Sample - USA Daily Temperatures

In [1]:
Sys.getenv("SPARK_HOME")

[1] "/Users/skalathur/MyApps/spark"

In [2]:
# Set the correct value for SPARK_HOME if not set in your environment
if (nchar(Sys.getenv("SPARK_HOME")) < 1) {
  Sys.setenv(SPARK_HOME = "/Users/skalathur/MyApps/spark")
}

In [3]:
Sys.setenv(SPARK_LOCAL_IP="localhost")

In [4]:
# load the SparkR library (wait until it loads)
library(SparkR, lib.loc = c(file.path(Sys.getenv("SPARK_HOME"), "R", "lib")))

Attaching package: ‘SparkR’

The following objects are masked from ‘package:stats’:

    cov, filter, lag, na.omit, predict, sd, var, window

The following objects are masked from ‘package:base’:

    as.data.frame, colnames, colnames<-, drop, endsWith, intersect,
    rank, rbind, sample, startsWith, subset, summary, transform, union

In [5]:
# Start the Spark Session, wait until it starts
sparkR.session(master = "local[*]", sparkConfig = list(spark.driver.memory = "2g"))

Spark package found in SPARK_HOME: /Users/skalathur/MyApps/spark

Launching java with spark-submit command /Users/skalathur/MyApps/spark/bin/spark-submit   --driver-memory "2g" sparkr-shell /var/folders/s3/hy6_p79n3w1fw802t6ps40qr0000gp/T//Rtmp7jfYHO/backend_portb3e27079c9f

Java ref type org.apache.spark.sql.SparkSession id 1

In [6]:
inputFile <- "/temp/datasets/usa_daily_avg_temps.csv"

In [7]:
# Read the csv file as a SparkDataFrame
usaDailyTemps <- read.df(inputFile, source = "csv", 
                         header='true', 
                         inferSchema='true')

usaDailyTemps

SparkDataFrame[state:string, city:string, month:int, day:int, year:int, avgtemp:double]

In [8]:
printSchema(usaDailyTemps)

root
 |-- state: string (nullable = true)
 |-- city: string (nullable = true)
 |-- month: integer (nullable = true)
 |-- day: integer (nullable = true)
 |-- year: integer (nullable = true)
 |-- avgtemp: double (nullable = true)

In [9]:
count(usaDailyTemps)

[1] 1174605

In [10]:
head(usaDailyTemps)

  state   city       month day year avgtemp
1 Alabama Birmingham 1     1   1995 50.7
2 Alabama Birmingham 1     1   1996 56.8
3 Alabama Birmingham 1     1   1997 60.9
4 Alabama Birmingham 1     1   1998 35.6
5 Alabama Birmingham 1     1   1999 41.0
6 Alabama Birmingham 1     1   2000 59.0

In [11]:
persist(usaDailyTemps, "MEMORY_AND_DISK")

SparkDataFrame[state:string, city:string, month:int, day:int, year:int, avgtemp:double]

In [12]:
# Register the DataFrame as a SQL table.
createOrReplaceTempView(usaDailyTemps, "usaDailyTempsTable")

### Aggregate to find the maximum of avgtemp

In [13]:
query <- "SELECT max(avgtemp) FROM usaDailyTempsTable"
query

[1] "SELECT max(avgtemp) FROM usaDailyTempsTable"

In [14]:
maxAvgTemp <- sql(query)
maxAvgTemp

SparkDataFrame[max(avgtemp):double]

In [15]:
count(maxAvgTemp)

[1] 1

In [16]:
# collect to local data frame
collect(maxAvgTemp)

  max(avgtemp)
1 107.5

In [17]:
# Provide the appropriate column name (MaxValue)

query <- "SELECT max(avgtemp) AS MaxValue FROM usaDailyTempsTable"

maxAvgTemp <- sql(query)
maxAvgTemp

SparkDataFrame[MaxValue:double]

In [18]:
localDf <- collect(maxAvgTemp)
localDf

  MaxValue
1 107.5

In [19]:
# Filter the SparkDataFrame to find the rows with the max value

query <- paste("SELECT * from usaDailyTempsTable WHERE avgtemp = ", 
               localDf[1, 'MaxValue'])
query

[1] "SELECT * from usaDailyTempsTable WHERE avgtemp =  107.5"

In [20]:
maxData <- sql(query)
maxData

SparkDataFrame[state:string, city:string, month:int, day:int, year:int, avgtemp:double]

In [21]:
# collect to local data frame
collect(maxData)

  state   city month day year avgtemp
1 Arizona Yuma 7     22  2006 107.5

### Aggregate to find the maximum of avgtemp grouping by Year

In [22]:
query <- "SELECT year, max(avgtemp) AS MaxValue FROM usaDailyTempsTable 
             GROUP BY year"
query

[1] "SELECT year, max(avgtemp) AS MaxValue FROM usaDailyTempsTable \n             GROUP BY year"

In [23]:
maxTempByYear <- sql(query)
maxTempByYear

SparkDataFrame[year:int, MaxValue:double]

In [24]:
count(maxTempByYear)

[1] 21

In [25]:
collect(maxTempByYear)

   year MaxValue
1  2003 105.8
2  2007 104.4
3  2015 105.1
4  2006 107.5
5  2013 104.9
6  1997 100.6
7  2014 103.8
8  2004 101.0
9  1996 104.3
10 1998 103.0
11 2012 103.4
12 2009 103.3
13 1995 104.3
14 2001 104.4
15 2005 105.5
16 2000 101.6
17 2010 103.4
18 2011 103.1
19 2008 102.9
20 1999 100.1
21 2002 102.6

In [26]:
query <- "SELECT year, max(avgtemp) AS MaxValue FROM usaDailyTempsTable 
               GROUP BY year ORDER BY year"
query

[1] "SELECT year, max(avgtemp) AS MaxValue FROM usaDailyTempsTable \n               GROUP BY year ORDER BY year"

In [27]:
maxTempByYear <- sql(query)
maxTempByYear

SparkDataFrame[year:int, MaxValue:double]

In [28]:
count(maxTempByYear)
collect(maxTempByYear)

[1] 21

   year MaxValue
1  1995 104.3
2  1996 104.3
3  1997 100.6
4  1998 103.0
5  1999 100.1
6  2000 101.6
7  2001 104.4
8  2002 102.6
9  2003 105.8
10 2004 101.0
11 2005 105.5
12 2006 107.5
13 2007 104.4
14 2008 102.9
15 2009 103.3
16 2010 103.4
17 2011 103.1
18 2012 103.4
19 2013 104.9
20 2014 103.8
21 2015 105.1

### Aggregate to find the maximum of avgtemp grouping by State

In [29]:
query <- "SELECT state, max(avgtemp) AS MaxValue FROM usaDailyTempsTable 
               GROUP BY state ORDER BY state"
query

[1] "SELECT state, max(avgtemp) AS MaxValue FROM usaDailyTempsTable \n               GROUP BY state ORDER BY state"

In [30]:
maxTempByState <- sql(query)
maxTempByState

SparkDataFrame[state:string, MaxValue:double]

In [31]:
count(maxTempByState)

[1] 50

In [32]:
collect(maxTempByState)

   state          MaxValue
1  Alabama         91.5
2  Alaska          79.5
3  Arizona        107.5
4  Arkansas       100.7
5  California     102.6
6  Colorado        94.7
7  Connecticut     89.8
8  Delaware        89.7
9  Florida         92.8
10 Georgia         97.7
11 Hawaii          87.2
12 Idaho           94.2
13 Illinois        92.3
14 Indiana         94.0
15 Iowa            93.0
16 Kansas          96.1
17 Kentucky        93.2
18 Louisiana       95.4
19 Maine           89.1
20 Maryland        92.8
21 Massachusetts   90.7
22 Michigan        89.4
23 Minnesota       92.0
24 Mississippi     92.8
25 Missouri        96.3
26 Montana        100.1
27 Nebraska        93.2
28 Nevada         105.5
29 New Hampshire   88.0
30 New Jersey      95.6
31 New Mexico      89.4
32 New York        93.7
33 North Carolina  91.0
34 North Dakota    91.7
35 Ohio            91.2
36 Oklahoma       100.4
37 Oregon          97.3
38 Pennsylvania    92.9
39 Rhode Island    89.2
40 South Carolina  92.8
41 South Dakota    94.3
42 Tennessee       94.1
43 Texas           98.5
44 Utah            92.2
45 Vermont         87.4
46 Virginia        93.5
47 Washington      97.7
48 West Virginia   92.5
49 Wisconsin       92.2
50 Wyoming         87.1

### Aggregate to find the number of entries grouping by State

In [ ]:
query <- "SELECT state, count(*) AS count FROM usaDailyTempsTable 
            GROUP BY state ORDER BY count DESC"
query

In [ ]:
stateCounts <- sql(query)
stateCounts

In [ ]:
collect(stateCounts)

### Aggregate to find the number of entries grouping by State and City

In [ ]:
query <- "SELECT state, city, count(*) AS count FROM usaDailyTempsTable 
            GROUP BY state, city ORDER BY state, city"
query

In [ ]:
stateCityCounts <- sql(query)
stateCityCounts

In [ ]:
collect(stateCityCounts)

### Number of cities for each state in the dataset

In [ ]:
# Register the DataFrame as a SQL table.

createOrReplaceTempView(stateCityCounts, "stateCityCountsTable")

In [ ]:
query <- "SELECT state, count(*) AS count FROM stateCityCountsTable 
             GROUP BY state ORDER BY state"
query

In [ ]:
collect(sql(query))

### Create a subset SparkDataFrame for Boston

In [33]:
query <- "SELECT * FROM usaDailyTempsTable WHERE city == 'Boston'"
query

[1] "SELECT * FROM usaDailyTempsTable WHERE city == 'Boston'"

In [34]:
bostonDailyTemps <- sql(query)

bostonDailyTemps

SparkDataFrame[state:string, city:string, month:int, day:int, year:int, avgtemp:double]

In [35]:
count(bostonDailyTemps)

[1] 7624

In [36]:
# Register the DataFrame as a SQL table.

createOrReplaceTempView(bostonDailyTemps, "bostonDailyTempsTable")

#### Boston Average Temperatures By Year

In [37]:
query <- "SELECT year, avg(avgtemp) AS Average FROM bostonDailyTempsTable
           GROUP BY year ORDER BY year"
query

[1] "SELECT year, avg(avgtemp) AS Average FROM bostonDailyTempsTable\n           GROUP BY year ORDER BY year"

In [38]:
bostonAvgTempsByYear <- sql(query)
bostonAvgTempsByYear

SparkDataFrame[year:int, Average:double]

In [39]:
collect(bostonAvgTempsByYear)

   year Average
1  1995 51.32027
2  1996 47.71749
3  1997 50.83863
4  1998 51.51562
5  1999 52.33945
6  2000 50.36148
7  2001 52.42822
8  2002 50.41205
9  2003 49.73014
10 2004 50.52514
11 2005 50.97726
12 2006 53.02055
13 2007 51.12219
14 2008 50.95355
15 2009 50.32247
16 2010 53.47205
17 2011 53.22384
18 2012 53.86749
19 2013 51.69753
20 2014 50.95452
21 2015 52.46959

#### Boston Average Temperatures By Year

In [40]:
query <- "SELECT month, avg(avgtemp) AS Average FROM bostonDailyTempsTable 
             GROUP BY month ORDER BY month"
query

[1] "SELECT month, avg(avgtemp) AS Average FROM bostonDailyTempsTable \n             GROUP BY month ORDER BY month"

In [41]:
bostonAvgTempsByMonth <- sql(query)
bostonAvgTempsByMonth

SparkDataFrame[month:int, Average:double]

In [42]:
collect(bostonAvgTempsByMonth)

   month Average
1   1    29.76667
2   2    31.47032
3   3    37.57604
4   4    47.08413
5   5    57.57803
6   6    66.10714
7   7    73.55038
8   8    71.68909
9   9    65.05762
10 10    54.73456
11 11    44.89366
12 12    34.99742

#### Boston Average Temperatures By Year and Month

In [43]:
query <- "SELECT year, month, avg(avgtemp) AS Average FROM bostonDailyTempsTable 
             GROUP BY year, month ORDER BY year, month"
query

[1] "SELECT year, month, avg(avgtemp) AS Average FROM bostonDailyTempsTable \n             GROUP BY year, month ORDER BY year, month"

In [44]:
bostonAvgTempsByYearAndMonth <- sql(query)
bostonAvgTempsByYearAndMonth

SparkDataFrame[year:int, month:int, Average:double]

In [45]:
collect(bostonAvgTempsByYearAndMonth)

    year month Average
1   1995  1    34.51935
2   1995  2    28.57500
3   1995  3    38.03871
4   1995  4    45.42000
5   1995  5    56.69677
6   1995  6    68.47667
7   1995  7    75.57419
8   1995  8    72.52581
9   1995  9    62.93667
10  1995 10    58.07742
11  1995 11    42.20333
12  1995 12    31.04194
13  1996  1    30.04516
14  1996  2    30.71034
15  1996  3    26.99355
16  1996  4    27.20000
17  1996  5    51.57419
18  1996  6    66.72667
19  1996  7    71.46452
20  1996  8    70.37419
21  1996  9    63.72667
22  1996 10    53.51613
23  1996 11    40.15000
24  1996 12    39.25484
25  1997  1    29.02258
26  1997  2    36.32500
27  1997  3    36.59032
28  1997  4    45.82333
29  1997  5    55.48710
30  1997  6    67.87333
⋮   ⋮    ⋮     ⋮
222 2013  6    68.80000
223 2013  7    76.05161
224 2013  8    71.67419
225 2013  9    64.59667
226 2013 10    56.28065
227 2013 11    42.61000
228 2013 12    33.29355
229 2014  1    26.78710
230 2014  2    29.05714
231 2014  3    33.06129
232 2014  4    47.81000
233 2014  5    58.10645
234 2014  6    68.11333
235 2014  7    73.54516
236 2014  8    70.27097
237 2014  9    65.94000
238 2014 10    56.24194
239 2014 11    42.64333
240 2014 12    38.42581
241 2015  1    26.41613
242 2015  2    19.50357
243 2015  3    32.83871
244 2015  4    47.81667
245 2015  5    61.81935
246 2015  6    63.80333
247 2015  7    73.16129
248 2015  8    73.84516
249 2015  9    68.78333
250 2015 10    53.93548
251 2015 11    53.14000

#### Boston years in data

In [ ]:
query <- "SELECT distinct(year) FROM bostonDailyTempsTable ORDER BY year"
query

In [ ]:
yearsDF <- collect(sql(query))
yearsDF

In [ ]:
# Stop the SparkSession now
sparkR.session.stop()